GREETING = f"Привет! 👋  Я — Ваш помощник по подготовке к ЕГЭ! 🎓\n\n" \
           f"Здесь Вы можете проверить свои знания по различным предметам, пройти тесты " \
           f"и получить обратную связь о своих результатах. 📚✨ \n\n" \
           f"📊 Также Вы сможете просмотреть свою статистику в профиле по команде /profile " \
           f"чтобы отслеживать прогресс и выявлять слабые места.\n\n" \
           f"Готовы начать? Давайте сделаем шаг к успешной сдаче ЕГЭ вместе! 🚀 "
USER_NOT_SUBSCRIBE = "Ты не зарегистрирован"
TEXT_NOT_SUBSCRIBE_CHANNEL = f"🌟 Для продолжения необходимо подписаться на наш телеграмм-канал, " \
                             f"посвященный обществознанию! 🌍 \n\n" \
                             f"🔍 Здесь вы найдете: \n\n" \
                             f"- 📚 Полезные материалы по обществознанию: конспекты, схемы, " \
                             f"тесты и задания для подготовки к ЕГЭ и другим экзаменам.\n " \
                             f"- 💬 Обсуждения актуальных тем: от прав человека до социальных явлений. \n" \
                             f"- 🎓 Советы по подготовке к экзаменам и эффективному обучению. \n" \
                             f"- 📈 Анализ типичных ошибок и разбор заданий, чтобы вы могли улучшить свои знания. \n" \
                             f"- 🤝 Возможность задать вопросы и получить ответы от опытного репетитора. "
TEXT_MAIN_CHAPTER = "Выберите направление подготовки"
TEXT_CHAPTER = "Выберите главу"
TEXT_UNDER_CHAPTER = "Выберите подглаву"
TEXT_ANSWER_MODE = "Выберите способ подготовки"
TEXT_INTRODUCE_TEST = "Инструкция к тесту"
TEXT_START_TEST = "Начало теста"

END_THEORY = "Прошу прощения 😔\n" \
             "Данная теория пока недоступна"

DONT_UNDERSTAND = "Я не понимаю тебя"
EMPTY_UNDER_CHAPTERS = "Больше нет"

SHORT_INTRODUCE_TEST = "Правильный формат ответов 125"
SUCCESS_TEST = "<b>Правильно</b> 🌟\n\nПродолжим?"
NOT_SUCCESS_TEST = "<b>Неправильно</b> 😔\n<b>Правильный ответ:</b> "
ABOUT_TEST = "<b>Пояснение</b>:\n\n"
END_TEST = "Задания закончились"
NEXT_CHAPTER = "Переход далее"

TEXT_COMMON_STATISTIC_1 = "🏆 Бот пройден на"
TEXT_COMMON_STATISTIC_2 = "✅ Пройдено заданий"
TEXT_COMMON_STATISTIC_3 = "📊 Процент правильности"

BUTTON_START_PREPARE_1 = 'Начать подготовку 🌟'
BUTTON_MAIN_CHAPTER = "Основная часть 📕"
BUTTON_START_PREPARE_2 = "Мой профиль 🧳"
BUTTON_MORE_STATISTIC = "Больше статистики 📊"
BUTTON_ABOUT_LEVEL = "Как повысить свой уровень? 🚀"
TEXT_READY_TEST = "Вперед ➡"
BACK_BUTTON = "⬅ Назад"
RETURN_BUTTON = "⬅ Обратно"
MORE_BUTTON = "Далее ➡"
NEXT_BUTTON = "Следующий ➡"

SHOW_ABOUT_TEXT = "Показать пояснение ⬇"
SHOW_ABOUT_INLINE = "Пояснение ‼"
LABEL_CHANNEL_BUTTON = "Школа гуманитариев|Общество ЕГЭ"
TEXT_LEVEL = "Проходи больше тестов, повышай процент правильности прохождения и у тебя все получится ☺"

CALLBACK_SHOW_ABOUT = "show_about_to_user"
